GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
	return ( ( ( (unsigned long)( year / 4 - year / 100 + year / 400 + 367 * mon / 12 + day ) +
	             year * 365 - 719499
	             ) * 24 + hour      /**//* now have hours */
	           ) * 60 + min         /**//* now have minutes */
	         ) * 60 + sec;          /**//* finally seconds */
}

/*计算距离*/
float calc_distance( void )
{
	static uint32_t utc_distance_last = 0;
#if 0
	if( gps_lati_last )                             /*首次定位*/
	{
		distance				= dis_Point2Point( gps_lati_last, gps_longi_last, gps_lati, gps_longi );
		total_distance			+= distance;
		jt808_param.id_0xF020	= total_distance;   /*总里程m*/
	}
	gps_lati_last	= gps_lati;
	gps_longi_last	= gps_longi;
	/**/
	return distance;
#endif
/*速度积分*/
	if( ( ( utc_now - utc_distance_last ) == 1 ) || ( utc_distance_last == 0 ) )
	{
		distance				+= gps_speed / 3.6; /*单位kmh->m/s*/
		total_distance			+= gps_speed / 3.6;
		jt808_param.id_0xF020	= total_distance;   /*总里程m*/
	}
	return distance;
}

#if 0
/**/
static double gpsToRad( GPSPoint point )
{
	return point.sign * ( point.deg + ( point.min + point.sec / 60.0 ) / 60.0 ) * 3.141592654 / 180.0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static double getDistance( GPSPoint latFrom, GPSPoint lngFrom, GPSPoint latTo, GPSPoint lngTo )
{
	double	latFromRad	= gpsToRad( latFrom );
	double	lngFromRad	= gpsToRad( lngFrom );
	double	latToRad	= gpsToRad( latTo );
	double	lngToRad	= gpsToRad( lngTo );
	double	lngDiff		= lngToRad - lngFromRad;
	double	part1		= pow( cos( latToRad ) * sin( lngDiff ), 2 );
	//double part2 = pow( cos(latFromRad)*sin(latToRad)*cos(lngDiff) , 2);
	double	part2 = pow( cos( latFromRad ) * sin( latToRad ) - sin( latFromRad ) * cos( latToRad ) * cos( lngDiff ), 2 );

	double	part3 = sin( latFromRad ) * sin( latToRad ) + cos( latFromRad ) * cos( latToRad ) * cos( lngDiff );
	//double centralAngle = atan2( sqrt(part1 + part2) / part3 );
	double	centralAngle = atan( sqrt( part1 + part2 ) / part3 );
	return 6371.01 * 1000.0 * centralAngle; //Return Distance in meter
}

#endif

#define DF_POSTREPORT_START		0x00298000
#define DF_POSTREPORT_END		0x002FC000
#define DF_POSTREPORT_SECTORS	100

typedef __packed struct
{
	uint32_t	mn;
	uint32_t	id;
	uint8_t		attr;
	uint8_t		unused;
	uint16_t	len;
}GPS_REPORT_HEAD;

static uint32_t report_curr_addr	= 0;    /*当前记录的地址*/
static uint32_t report_curr_id		= 0;    /*当前记录的最大id*/
static uint32_t report_curr_len		= 0;    /*当前记录的用户信息长度*/

static uint32_t report_addr_rd	= 0;        /*要读记录的位置,第一个未上报的数据位置*/
static uint32_t report_count	= 0;        /*还没有上报的记录数*/
static uint8_t	report_first	= 1;        /*第一条上报不需要搽除以前的*/


/*
   查找最后一个写入的位置
   查找未上报记录最小id的位置
 */
void jt808_report_init( void )
{
	uint32_t		addr;
	GPS_REPORT_HEAD head;
	uint32_t		read_id = 0xFFFFFFFF;
	if( rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 ) != RT_EOK )
	{
		rt_kprintf( "\n初始化上报失败" );
	}
	report_count		= 0;                /*重新查找*/
	report_addr_rd		= 0;
	report_curr_addr	= 0;
	report_curr_id		= 0;
	for( addr = DF_POSTREPORT_START; addr < DF_POSTREPORT_END; addr += 64 )
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )         /*有效记录*/
		{
			if( head.id >= report_curr_id ) /*查找最近记录*/
			{
				report_curr_id		= head.id;
				report_curr_addr	= addr; /*当前记录的地址*/
				report_curr_len		= head.len;
			}
			if( head.attr == 0xFF )         /*还没有发送*/
			{
				report_first = 1;           /*第一包数据*/
				report_count++;             /*统计未上报记录数*/
				if( read_id > head.id )     /*要找到最小的*/
				{
					report_addr_rd	= addr;
					read_id			= head.id;
				}
			}
		}
	}
	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)写入位置:%x id=%d 读出位置:%x id=%d",
	            rt_tick_get( ),
	            report_count,
	            report_curr_addr,
	            report_curr_id,
	            report_addr_rd,
	            read_id );
}

/*补报数据保存*/
void jt808_report_put( uint8_t* pinfo, uint16_t len )
{
	GPS_REPORT_HEAD head;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	if( report_curr_addr )                  /*当先的上报地址*/
	{
		report_curr_addr	+= ( 12 + report_curr_len + 63 );
		report_curr_addr	&= 0xFFFFFFC0;  /*指向下一个地址*/
	}else                                   /*还没有记录*/
	{
		report_curr_addr = DF_POSTREPORT_START;
	}

	if( report_curr_addr >= DF_POSTREPORT_END )
	{
		report_curr_addr = DF_POSTREPORT_START;
	}
	if( ( report_curr_addr & 0xFFF ) == 0 )
	{
		sst25_erase_4k( report_curr_addr );
	}

	report_curr_id++;

	head.mn		= 0x474E5353;
	head.id		= report_curr_id;
	head.len	= len;
	head.attr	= 0xFF;

	sst25_write_through( report_curr_addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
	sst25_write_through( report_curr_addr + 12, pinfo, len );
	report_count++;             /*增加未上报记录数*/
	if( report_count == 1 )     /*要找到最小的*/
	{
		report_addr_rd	= report_curr_addr;
		report_first	= 1;    /*首条上报*/
	}
	report_curr_len = len;

	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)写入位置:%x id=%d", rt_tick_get( ), report_count, report_curr_addr, report_curr_id );
}

/*查找第一个未上报的记录,不一定就是记录号最小的*/
static uint32_t jt808_report_get_next( uint32_t start_addr )
{
	uint32_t		addr = start_addr;
	GPS_REPORT_HEAD head;
	uint32_t		i;

	for( i = 0; i < DF_POSTREPORT_SECTORS * 64; i++ )   /*每记录64字节,每sector(4096Byte)有64记录*/
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                     /*有效记录*/
		{
			if( head.attr == 0xFF )                     /*还没有发送*/
			{
				return addr;
			}
		}
		addr += 64;
		if( addr >= DF_POSTREPORT_END )
		{
			addr = DF_POSTREPORT_START;
		}
	}
	return 0;                                                   /*没找到*/
}

/*
   补报数据更新原先的并读取新纪录
   每次收到中心应答后调用
   每次重新拨号成功后都要从新确认一下
   区分首次读还是上报中的读记录
 */
void jt808_report_get( void )
{
	GPS_REPORT_HEAD head;
	uint8_t			buf[256];                                   /*单包上报的字节不大于256*/
	if( report_count == 0 )                                     /*没有有未上报记录*/
	{
		return;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	if( report_first == 0 )                                     /*不是首条上报,需要删除本次记录*/
	{
		sst25_read( report_addr_rd, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                             /*有效记录*/
		{
			head.attr = 0xFE;                                   /*已发送*/
			sst25_write_through( report_addr_rd, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		}
		report_count--;                                         /*未上报记录数-1*/
	}
	report_first = 0;

