GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
	report_addr_rd = jt808_report_get_next( report_addr_rd );   /*从开始找*/
	if( report_addr_rd == 0 )                                   /*没找到!!!!*/
	{
		report_count = 0;
		rt_kprintf( "\n没找到!!!" );
		report_first = 1;
	}else
	{
		sst25_read( report_addr_rd, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.len < 255 )
		{
			sst25_read( report_addr_rd + 12, buf, head.len );
			jt808_tx( 0x0200, buf, head.len );
		}
	}
	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)读出位置:%x,长度:%d", rt_tick_get( ), report_count, report_addr_rd, head.len );
}

/*
   处理gps信息,有多种条件组合，上报
   此时已收到争取的
 */

#define FLAG_SEND_AREA			0x80
#define FLAG_SEND_STATUS		0x01
#define FLAG_SEND_ALARM			0x02
#define FLAG_SEND_FIX_TIME		0x04
#define FLAG_SEND_FIX_DISTANCE	0x08


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void process_gps_report( void )
{
	static uint32_t utc_report_last = 0;
	uint32_t		tmp;
	uint8_t			flag_send	= 0; /*默认不上报*/
	uint8_t			*palarmdata = RT_NULL;
	uint16_t		alarm_length;
	uint32_t		alarm_bits;

	uint8_t			buf[300];

/*区域路线处理*/
	alarm_bits = area_get_alarm( palarmdata, &alarm_length );
	if( alarm_bits ) /*有告警*/
	{
		rt_kprintf( "\n区域有告警" );
		memcpy( buf + 28, palarmdata, alarm_length );
		flag_send = FLAG_SEND_AREA;
	}
	jt808_alarm			|= alarm_bits;
	gps_baseinfo.alarm	= BYTESWAP4( jt808_alarm );
	gps_baseinfo.status = BYTESWAP4( jt808_status );
	memcpy( buf, (uint8_t*)&gps_baseinfo, 28 );

/*中心追踪,直接上报，并返回*/
	if( jt808_8202_track_duration ) /*要追踪*/
	{
		jt808_8202_track_counter++;
		if( jt808_8202_track_counter >= jt808_8202_track_interval )
		{
			jt808_8202_track_counter = 0;
			jt808_tx( 0x0200, buf, 28 + alarm_length );
			if( jt808_8202_track_duration > jt808_8202_track_interval )
			{
				jt808_8202_track_duration -= jt808_8202_track_interval;
			}else
			{
				jt808_8202_track_duration = 0;
			}
		}
		return;
	}

/*数据上报方式,如何组合出各种情况 */
	tmp = jt808_status ^ jt808_status_last;
	if( tmp )                                           /*状态发生变化，要上报,*/
	{
		flag_send |= FLAG_SEND_STATUS;
	}
	/*不理解这个登录状态*/
	if( tmp & BIT_STATUS_ACC )                          /*ACC变化,修改汇报的间隔或距离*/
	{
		jt808_report_distance	= 0;
		jt808_report_interval	= 0;
		if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 )   /*有定时上报*/
		{
			if( jt808_status & BIT_STATUS_ACC )         /*当前状态为ACC开*/
			{
				jt808_report_interval = jt808_param.id_0x0029;
			}else
			{
				jt808_report_interval = jt808_param.id_0x0027;
			}
			utc_report_last = utc_now;                  /*重新计时*/
		}
		if( jt808_param.id_0x0020 )                     /*有定距上报*/
		{
			if( jt808_status & BIT_STATUS_ACC )         /*当前状态为ACC开*/
			{
				jt808_report_distance = jt808_param.id_0x002C;
			}else
			{
				jt808_report_distance = jt808_param.id_0x002E;
			}
			distance = 0;                               /*重新计算距离*/
		}
	}

	tmp = ( jt808_alarm ^ jt808_alarm_last );           /*告警位变化*/
	if( tmp )                                           /*告警发生变化，要上报,*/
	{
		flag_send |= FLAG_SEND_ALARM;
	}

	if( tmp & BIT_ALARM_EMG )                           /*紧急告警*/
	{
		if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 )   /*有定时上报*/
		{
			jt808_report_interval	= jt808_param.id_0x0028;
			utc_report_last			= utc_now;
		}
		if( jt808_param.id_0x0020 )                     /*有定距上报*/
		{
			jt808_report_distance	= jt808_param.id_0x002F;
			distance				= 0;
		}
	}

/*计算定时上报*/
	if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 ) /*有定时上报*/
	{
		if( utc_now - utc_report_last >= jt808_report_interval )
		{
			flag_send		|= FLAG_SEND_FIX_TIME;
			utc_report_last = utc_now;
		}
	}
/*计算定距上报*/
	if( jt808_param.id_0x0020 ) /*有定距上报*/
	{
		if( distance >= jt808_report_distance )
		{
			flag_send	|= FLAG_SEND_FIX_DISTANCE;
			distance	= 0;
		}
	}

	jt808_status_last	= jt808_status;
	jt808_alarm_last	= jt808_alarm;

/*生成要上报的数据,在线时直接上报，还是都暂存再上报，后者。*/
#if 1
	if( flag_send )
	{
		jt808_report_put( buf, 28 + alarm_length );
	}
#endif

#if 0
	if( flag_send )
	{
		jt808_tx( 0x0200, buf, 28 + alarm_length );
		rt_kprintf( "\n%d>上报gps(%02x)", rt_tick_get( ), flag_send );
	}
#endif
}

/*
   $GNRMC,074001.00,A,3905.291037,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNTXT,01,01,01,ANTENNA OK*2B7,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNGGA,074002.00,3905.291085,N,11733.138264,E,1,11,0.9,8.2,M,-1.6,M,,,1.4*68E
   $GNGLL,3905.291085,N,11733.138264,E,074002.00,A,0*02.9,8.2,M,-1.6,M,,,1.4*68E
   $GPGSA,A,3,18,05,08,02,26,29,15,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*3F8E
   $BDGSA,A,3,04,03,01,07,,,,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*220.9*3F8E
   $GPGSV,2,1,7,18,10,278,29,05,51,063,08,21,052,24,02,24,140,45*4C220.9*3F8E
   $GPGSV,2,2,7,26,72,055,24,29,35,244,37,15,66,224,37*76,24,140,45*4C220.9*3F8E
   $BDGSV,1,1,4,04,27,124,38,03,42,190,34,01,38,146,37,07,34,173,35*55220.9*3F8E

   返回处理的字段数，如果正确的话
 */

static uint8_t process_rmc( uint8_t * pinfo )
{
	//检查数据完整性,执行数据转换
	uint8_t		year = 0, mon = 0, day = 0, hour = 0, min = 0, sec = 0, fDateModify = 0;
	uint32_t	degrees, minutes;
	uint8_t		commacount = 0, count = 0;

	uint32_t	lati		= 0, longi = 0;
	uint16_t	speed_10x	= 0;
	uint16_t	cog			= 0;    /*course over ground*/

	uint8_t		i;
	uint8_t		buf[20];
	uint8_t		*psrc = pinfo + 6;  /*指向开始位置 $GNRMC,074001.00,A,3905.291037,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E*/

/*因为自增了一次，所以从pinfo+6开始*/
	while( *psrc++ )
	{
		if( *psrc != ',' )
		{
			buf[count++]	= *psrc;
			buf[count]		= 0;
			continue;
		}

		commacount++;
		switch( commacount )
		{
			case 1: /*时间*/
				if( count < 6 )
				{
					return 1;
				}

				i = ( buf[0] - 0x30 ) * 10 + ( buf[1] - 0x30 ) + 8;
				if( i > 23 )
				{
					fDateModify = 1;
					i			-= 24;
				}
				/*转成HEX格式*/
				hour	= i;
				min		= ( buf[2] - 0x30 ) * 10 + ( buf[3] - 0x30 );
				sec		= ( buf[4] - 0x30 ) * 10 + ( buf[5] - 0x30 );
				break;
			case 2:                         /*A_V*/
				if( buf[0] != 'A' )         /*未定位*/
				{
					jt808_status	&= ~BIT_STATUS_FIXED;
					gps_lati_last	= 0;    /*从新计算距离*/
					gps_longi_last	= 0;
					gps_speed		= 0;
					return 2;
				}
				jt808_status |= BIT_STATUS_FIXED;

