GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
	if( strncmp( psrc + 3, "GGA,", 4 ) == 0 )
	{
		if( strncmp( psrc + 1, "GN", 2 ) == 0 )
		{
			gps_status.mode = MODE_BDGPS;
		}else if( strncmp( psrc + 1, "GP", 2 ) == 0 )
		{
			gps_status.mode = MODE_GPS;
		}else if( strncmp( psrc + 1, "BD", 2 ) == 0 )
		{
			gps_status.mode = MODE_BD;
		}
		process_gga( (uint8_t*)psrc );
	}

	if( strncmp( psrc + 3, "RMC,", 4 ) == 0 )
	{
		gps_sec_count++;
		ret = process_rmc( (uint8_t*)psrc );

		if( ret == 0 )                          /*已定位*/
		{
			gps_notfixed_count = 0;
			process_hmi_15min_speed( );         /*最近15分钟速度*/
			vdr_rx_gps( );                      /*行车记录仪数据处理*/
			area_process( );                    /*区域线路告警*/
			calc_distance( );
		}else
		{
			adjust_mytime_now( );               /*调整mytime_now*/
			gps_notfixed_count++;
		}
		process_gps_report( );                  /*处理GPS上报信息*/
	}


	/*天线开短路检测 gps<
	   $GNTXT,01,01,01,ANTENNA OK*2B
	   $GNTXT,01,01,01,ANTENNA OPEN*3B
	 */
	if( strncmp( psrc + 3, "TXT", 3 ) == 0 )
	{
		if( jt808_param.id_0xF013 != 0x3017 )   /*型号不对,保存新的，并重启*/
		{
			rt_kprintf( "\njt808_param.id_0xF013=%04x", jt808_param.id_0xF013 );
			jt808_param.id_0xF013 = 0x3017;
			param_save( );
			reset( 0xff );
		}
		if( strncmp( psrc + 24, "OK", 2 ) == 0 )
		{
			gps_status.Antenna_Flag = 0;
			jt808_alarm				&= ~( BIT_ALARM_GPS_OPEN | BIT_ALARM_GPS_SHORT );
		}else if( strncmp( psrc + 24, "OPEN", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_alarm				|= BIT_ALARM_GPS_OPEN; /*bit5 天线开路*/
		}else if( strncmp( psrc + 24, "SHORT", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_alarm				|= BIT_ALARM_GPS_SHORT;
		}
	}
}

/*初始化jt808 gps相关的处理*/
void jt808_gps_init( void )
{
	jt808_report_init( );   /*上报区域初始化*/
	jt808_vehicle_init( );  /*车辆信息初始化*/
	area_init( );
	gps_pack_init( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_dump( uint8_t mode )
{
	gps_status.Raw_Output = ~gps_status.Raw_Output;
}

FINSH_FUNCTION_EXPORT( gps_dump, dump gps raw info );

/************************************** The End Of File **************************************/

#ifdef DEBUG_GPS
/**模拟调试gps速度*/
void gps_speed_add( uint8_t sp, uint32_t count )
{
	speed_add	= sp;
	speed_count = count;
}

FINSH_FUNCTION_EXPORT_ALIAS( gps_speed_add, gps_speed, debug gps speed );
#endif

/************************************** The End Of File **************************************/
